#ifndef TOOL_H
#define TOOL_H

#include <windows.h>
#include <string>

class CTool
{
public:
	CTool();
	~CTool();

	/************************************************************************/
	/* 获取当前应用的绝对路径
	/************************************************************************/
	bool GetApplicationPath(wchar_t(&des)[MAX_PATH]);

	/************************************************************************/
	/* 当前编码为unicode,char转wchar_t
	/************************************************************************/
	std::wstring ANSIToUnicode(const std::string& str);

	/************************************************************************/
	/* 当前编码为unicode,wchar_t转char
	/************************************************************************/
	std::string UnicodeToANSI(const std::wstring& str);

	/************************************************************************/
	/* 当前编码为UTF8,char转wchar_t
	/************************************************************************/
	std::wstring UTF8ToUnicode(const std::string& str);

	/************************************************************************/
	/* 当前编码为UTF8,wchar_t转char
	/************************************************************************/
	std::string UnicodeToUTF8(const std::wstring& str);
private:

};
#endif